Repository: germanengit/abs-guide-ca
Catalog: inputRst/locale/*/LC_MESSAGES/why-shell.po
Languages: es

source: 1. Perquè programar en Shell
es: 1. Porqué programar en Shell

source: Si tens intenció d'administrar sistemes informàtics de manera mínimament decent, tard o d'hora et caldrà disposar de coneixements de programació de guions. Fins i tot, si ara ni se t'acut per a què et pot servir.
es: Si tienes intención de administrar sistemas informáticos de una forma mínimamente decente, tarde o temprano necesitarás disponer de conocimientos de programación de scripts. Incluso, aunque ahora ni se te ocurra para que pueden servir.

source: Per exemple, quan una màquina GNU/Linux arrenca, executa els guions que troba a la carpeta ``/etc/rc.d`` per recuperar la configuració del sistema i arrencar els serveis. És important comprendre el detall d'aquests guions per a poder analitzar el comportament del sistema i, si es cau, modificar-lo.
es: Por ejemplo, cuando una máquina GNU/Linux arranca, ejecuta los scripts que encuentra en la carpeta ``/etc/rc.d`` para recuperar la configuración del sistema y levantar los servicios. Es importante una comprensión detallada de estos scripts para poder analizar el comportamiento del sistema, y si es necesario, modificarlo

source: No és massa difícil dominar la programació de guions ja que poden ser escrits en seccions molt petites i només cal aprendre un conjunt força reduït d'opcions i operadors que siguin específics de la *shell* [#builtins]_.
es: No es muy difícil dominar la programación de scripts, ya que pueden ser construidos en secciones muy pequeñas y solo hay que aprender un conjunto reducido de opciones y operadores específicos de la *shell* [#builtins]_.

source: La sintaxi és força simple, hom diria austera, similar a la que fem servir quan encadenem utilitats en una mateixa línia de la línia de comandes. A més, hi ha poques "regles" que defineixen el seu ús.
es: La sintaxis es muy simple, se podría decir que austera, similar a la que utilizamos cuando invocamos y encadenamos utilerías en la línea de comandos. Además hay solo unas pocas "reglas" que definen su uso.

source: La majoria dels guions breus solen funcionar a la primera i, depurar guions, fins i tot els més llargs, és trivial.
es: La mayoría de pequeños scripts suelen funcionar a la primera, e incluso depurar losmás grandes es trivial.

source: Quan van aparèixer els primers ordinadors personals, el llenguatge de programació BASIC permetia que qualsevol amb una mica d'habilitat amb l'ordinador pogués escriure programes per aquells microcomputadors.
es: Cuando aparecieron los primeros ordenadores personales, el lenguaje BASIC permitía que cualquiera con un poco de habilidad en computadoras pudiera escribir programas para aquellos microcomputadores.

source: Dècades més tard, el llenguatge de guions Bash permet que qualsevol amb un coneixement rudimentari de GNU/Linux (o UNIX), pugui també escriure programes en les màquines actuals.
es: Décadas después, el lenguaje de scripts Bash permite que cualquiera con un conocimientos rudimentario de GNU/Linux (o UNIX), pueda hacer lo mismo en las máquinas modernas.

source: Ara disposem d'ordinadors miniatura amb capacitats increïbles, com ara la `Raspberry Pi <http://www.raspberrypi.org/>`_, i Bash està aquí per permetre explorar les possibilitats que ofereixen.
es: Ahora que hemos miniaturizado computadoras de una placa con capacidades increíbles, como la `Raspberry Pi <http://www.raspberrypi.org/>`_,La programación Bash proporciona una manera de explorar las capacidades de éstos fascinantes dispositivos.

source: Un guió de shell (o *shell script*) permet realitzar àgilment prototipus d'aplicacions més complexes. Sovint és útil disposar d'un subconjunt limitat de funcionalitats executant-se des d'un guió en les primeres fases de desenvolupament d'un projecte. D'aquesta manera, és possible provar l'estructura de l'aplicació, i arreglar els errors que es trobin, abans de realitzar la codificació final en llenguatges com ara *C*, *C++*, *Java*, :doc:`Perl <wrapper>`, o *Python*.
es: Un script de shell es un método ágil para esbozar aplicaciones complejas. Disponer de incluso un subconjunto limitado de funcionalidades ejecutándose desde un script, es muy útil en las primeras etapas de desarrollo de un proyecto. De esta manera es posible probar la estructura de la aplicación, y arreglar errores que se encuentren, antes de la codificación final en lenguajes como *C*, *C++*, *Java*, :doc:`Perl <wrapper>`, o *Python*.

source: Els guions de shell s'inspiren que la clàssica filosofia UNIX de dividir tasques complexes en subtasques més simples, per després encadenar-les juntes de manera que resolguin la tasca complexa.
es: Los scripts de shell se inspiran en la filosofía clásica UNIX de dividir tareas complejas en subtareas más simples, para después encadenarlas juntas.

source: Hi ha qui considera aquesta manera de resoldre els problemes, millor o com a mínim més estètica, que la de fer servir llenguatges tot-inclòs com pot ser *Perl*, que intenten servir per a tot i per a tothom, amb el cost de forçar a tothom a canviar la manera de pensar per a adaptar-te a l'eina.
es: Hay quién considera esta manera la mejor, o al menos un enfoque más estético a la resolución de problemas, que utilizar lenguajes todo-incluido como puede ser *Perl*, que intentan servir para todo y para todos, a costa de forzarte a cambiar tu manera de pensar para adaptarse a la herramienta.

source: Segons :ref:`Herbert Mayer <HERB89>`, *per què un llenguatge sigui útil, cal que disposi de cadenes (arrays), punters i algun mecanisme genèric per crear estructures de dades*. Amb aquests criteris, la programació en *shell* quedaria una mica per sota de ser "útil". O, potser no...
es: Según :ref:`Herbert Mayer <HERB89>`, *para que un lenguaje sea útil, necesita matrices, punteros, y un mecanismo genérico para crear estructuras de datos*. Con estos criterios, la programación *shell* queda por debajo de ser "útil". O, quizás no ...

source: Hi ha algunes situacions en les que no voldrem fer servir guions de shell:
es: Cuando no usar scripts de shell

source: Amb tasques que requereixin un ús intensiu de recursos, especialment quan la velocitat és important, com ara ordenació, càlcul de funcions de *hash*, recursivitat [#recursio]_
es: Tareas que requieren uso intensivo de recursos, especialmente cuando lavelocidad es importante (ordenación, calculo de funciones *hash*, recursividad [#recursio]_

source: Procediments que requereixen operacions matemàtiques molt pesants, especialment amb aritmètica de punt flotant, càlculs de precisió arbitrària, o nombres complexos. En aquest cas és millor que facis servir *C* o *FORTRAN*.
es: Procedimientos que requieren operaciones matemáticas pesadas, especialmente las de punto flotante, cálculos de precisión arbitraria,

source: Quan cal aconseguir portabilitat (és a dir, que el programa funcioni en altres plataformes). En aquest cas, fes servir *C* o *Java*.
es: Cuando se requiere portabilidad entre prataformas (usad *C* o *Java*).

source: Aplicacions complexes on cal una estructura de programa (comprovació de tipus de variables, prototipus de funcions, etc.)
es: Aplicaciones complejas donde la programación estructurada es una necesidad (comprobación de tipos de variables, prototipos de funciones, etc.)

source: Aplicacions de missió crítica de les que dependrà el futur de la teva empresa.
es: Aplicacions críticas en las que apuestas el futuro de tu empresa

source: Situacions en les que la *seguretat* sigui important, en les que calgui garantir la integritat del teu sistema i protegir-lo contra intrusos, *cracking* i vandalisme.
es: Situaciones en las que la *seguridad* sea importante, en las que necesites garantizar la integridad de tu sistema y protegerlo contra intrusos, *cracking* i vandalismo.

source: Quan el projecte consisteix en subcomponents amb dependències entrellaçades.
es: Cuando el proyecto consiste en subcomponentes con dependencias entrelazadas.

source: Aplicacions que requereixin operacions extensives sobre fitxers. *Bash* es limita a l'accés en sèrie d'una manera particularment ineficient línia a línia.
es: Aplicaciones que requieren operaciones extensas sobre archivos. (*Bash* se limita al acceso en série de una manera particularmente ineficiente línea a línea.)

source: Si es requereix un suport nadiu a matrius (*arrays* multidimensionals)
es: Si se necesita soporte nativo para matrices (*arrays* multidimensionales)

source: Quan calen estructures de dades, com ara llistes enllaçades o arbres.
es: Son necesarias estructura de datos, coomo listas enlazadas o arboles.

source: Si cal generar o manipular gràfics o interfícies gràfiques d'usuari.
es: Es necesario generar o manipular gráficos o interfaces gráficas.

source: Si cal l'accés directe al maquinari del sistema o a perifèrics externs.
es: Es necesario acceso directo al hardware del sistema o periféricos.

source: Si cal entrada/sortida a través de :doc:`sockets <devref1>`.
es: Es necesario entrada/salida mediante :doc:`sockets <devref1>`.

source: Quan cal fer servir biblioteques o accedir a codi heretat.
es: Es necesario usar bibliotecas o interfaces de código heredado.

source: Quan l'aplicació ha de ser de codi tancat, donat que els guions de shell mostren el codi obertament llegible per tothom.
es: Aplicaciones privativas de código cerrado (los scripts de shell hacen visible el código a todo el mundo)

source: Si el teu projecte presenta alguna de les necessitats anteriors, planteja't fer servir un llenguatge de programació de guions més potent (com ara *Perl*, *Tcl*, *Python*, *Ruby*) o fins i tot algun llenguatge compilat com *C*, *C*, o *Java*. Fins i tot en aquests casos és probable que et continuï resultant útil començant construir prototips de la teva aplicació amb shell script.
es: Si da alguna de las situaciones anteriores, considera utilizar un lenguaje de programación más potente (quizás *Perl*, *Tcl*, *Python*, *Ruby*) o posiblemente una lenguaje compilado como *C*, *C*, o *Java*. Incluso entonces, esbozar la aplicación como un script de shell puede ser útil en el proceso de desarrollo.

source: En aquest llibre farem servir *Bash*, acrònim [#acronim]_ de "Bourne-Again shell" i un joc de paraules sobre el ja clàssic "Bourne Shell" de Stephen Bourne. Bash s'ha convertit en l'estàndard *de facto* de la programació de guions a la majoria de les distribucions i varietats UNIX/Linux. Molts dels elements que cobreix aquest llibre també funcionen amb altres shells, com ara *Korn Shell*, de la que Bash hereta part de les seves característiques [#kornshell]_, de la mateixa manera que *C Shell* i les seves variants. Cal tenir present que la programació en *C Shell* no està recomanada per problemes inherents, tal i com va ser indicat a una `entrada a Usenet <http://www.faqs.org/faqs/unix-faq/shell/csh-whynot/>`_ del Tom Christiansen d'octubre de 1993
es: En este libro usaremos *Bash*, acrónimo [#acronim]_ de "Bourne-Again shell" y juego de palabras sobre el ya clásico "Bourne Shell" de Stephen Bourne. Bash se ha convertido en el estándar *de facto* de la programación de scripts en la mayoría de las distribuciones y variedades de UNIX/Linux. La mayoría de los principios que cubre este libro funcionan en otras shell, como *Korn Shell*, de la Bash hereda parte de sus características [#kornshell]_, de la misma manera que *C Shell* y sus variantes. (Tener presente que la *C Shell* no se recomienda debido a ciertos problemas heredados, como se señala en la siguiente `entrada a Usenet <http://www.faqs.org/faqs/unix-faq/shell/csh-whynot/>`_ de Tom Christiansende Octubre de 1993.)
