Repository: germanengit/abs-guide-ca
Catalog: */PO_MO_files/index.po
Languages: es

source: Guia Avançada de Programació en Bash
es: Guía Avanzada de Programación Bash

source: Una exploració en profunditat de l'art de la programació Bash
es: Una exploración en profundidad del arte de la programación

source: Per *Mendel Cooper*: ``<thegrendel.abs (at) gmail (dot) com>``
es: Original Inglés *Mendel Cooper*:``<thegrendel.abs (at) gmail (dot) com>``

source: Revisió 10 del 10 Març de 2014
es: Revisión 10 con fecha 10 Marzo del 2014

source: Traduït per *Moisès Gómez*: ``<moiatgit (a) gmail (punt) com>``
es: Traducido por *Germán Alonso*:``<germanengit (a) gmail (punt) com>`` en base a la traducción catalana de *Moisès Gómez*: ``<moiatgit (a) gmail (punt) com>``

source: Introducció
es: Introducción

source: Tens al davant un llibre de programació de guions en *Bash*. Està escrit en forma de tutorial i no pressuposa cap coneixement previ de programació. Això sí, avança molt ràpidament cap a un nivell intermedi/avançat, tot jugant amb les petites meravelles del GNU/Linux.
es: Tienes delante un libro de programación de scripts *Bash*. Está escrito en forma de tutorial y no presupone ningún conocimiento previo de programación. Eso sí, avanza muy rápidamente a un nivel intermedio/avanzado, mientras jugamos con las pequeñas maravillas GNU/LINUX.

source: Ha estat ideat per poder ser usat de diferents maneres:
es: Ha sido ideado para poder ser usado de diferentes maneras:

source: com a llibre de text
es: como libro de texto

source: com a manual d'autoaprenentatge
es: como manual de auto-aprendizaje

source: com a referència i font de coneixement de les tècniques de programació de guions.
es: como referencia y fuente de conocimiento de las técnicas de programación de scripts.

source: Hi trobaràs exercicis i exemples comentats amb profusió, que et convidaran a fer proves pel teu compte, sota la premissa de que *l'única manera d'aprendre a programar guions és escrivint guions*.
es: Encontrarás ejercicios y ejemplos comentados en profundidad que te invitarán a hacer pruebas por tu cuenta, bajo la premisa de que *la única manera de aprender a programar scripts es escribiéndolos*.

source: Aquest llibre és apte per l'ús dins de l'aula i com a introducció general als conceptes de programació.
es: Este libro es apto para el uso dentro del aula y como introducción general a los conceptos de programación.

source: Aquest document, a l'igual que l'original, està lliurat al *Domini Públic* i per tant, no hi ha cap *Copyright*.
es: Este documento, igual que el original, está bajo *Dominio Público* y por tanto, no hay *Copyright*.

source: Dedicatòria
es: Dedicatoria

source: A Anita, la font de tota la màgia.
es: A Anita, la fuente de toda la magia.

source: Taula de continguts
es: Tabla de contenidos

source: Índexs i taules
es: Índices y tablas
